---
title: SpotLightDistribution
classe: Autodesk.Revit.DB.Lighting.SpotLightDistribution
namespace: Autodesk.Revit.DB.Lighting
eredita: Autodesk.Revit.DB.Lighting.LightDistribution
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# SpotLightDistribution

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double SpotBeamAngle { get; set; }` | `spotLightDistribution.SpotBeamAngle` | Double |
| `Double SpotFieldAngle { get; set; }` | `spotLightDistribution.SpotFieldAngle` | Double |
| `Double TiltAngle { get; set; }` | `spotLightDistribution.TiltAngle` | Double |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```